<?php
// includes/categories.php

// قائمة التخصصات الموحدة
$specializations = [
    'خياطة رجالي',
    'خياطة نسائي',
    'خياطة أطفال',
    'فساتين أعراس',
    'جلابة وقنادر',
    'بدلات رسمية',
    'أفرشة وستائر',
    'تطريز',
    'خياطة تقليدية',
    'خياطة عصرية',
    'تعديل وتفصيل',
    'خياطة جلدية',
    'خياطة رياضية',
    'ملابس تقليدية',
    'قنادر',
    'كاراكو',
    'بلوزات',
    'ستائر و مفروشات',
    'تطريز يدوي',
    'تطريز آلي'
];

// قائمة الولايات الجزائرية
$algerian_cities = [
    'أدرار', 'الشلف', 'الأغواط', 'أم البواقي', 'باتنة', 'بجاية', 'بسكرة', 'بشار', 'البليدة', 'البويرة',
    'تامنراست', 'تبسة', 'تلمسان', 'تيارت', 'تيزي وزو', 'الجزائر', 'الجلفة', 'جيجل', 'سطيف', 'سعيدة',
    'سكيكدة', 'سيدي بلعباس', 'عنابة', 'قالمة', 'قسنطينة', 'المدية', 'مستغانم', 'المسيلة', 'معسكر', 'ورقلة',
    'وهران', 'البيض', 'إليزي', 'برج بوعريريج', 'بومرداس', 'الطارف', 'تندوف', 'تيسمسيلت', 'الوادي', 'خنشلة',
    'سوق أهراس', 'تيبازة', 'ميلة', 'عين الدفلى', 'النعامة', 'عين تموشنت', 'غرداية', 'غليزان',
    'المغير', 'المنيعة', 'أولاد جلال', 'برج باجي مختار', 'بني عباس', 'تيميمون', 'تقرت', 'جانت', 'عين صالح',
    'عين قزام'
];
sort($algerian_cities);
?>